---
type: DesignOption
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# DesignOption

`Autodesk.Revit.DB.DesignOption` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetActiveDesignOptionId | 2011 | `public static ElementId GetActiveDesignOptionId ( Document document )` |
| Property | IsPrimary | — | `public bool IsPrimary { get ; }` |
| Property | Parameter | — | `` |